ycsb-results/mssql/a/rc20-op10/tc4/run1.txt
/usr/bin/java  -classpath /home/atz2nd/Desktop/editycsb/YCSB/conf:/home/atz2nd/Desktop/editycsb/YCSB/core/target/core-0.17.0-SNAPSHOT.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/src/main/conf:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/jdbc-mssql-binding-0.17.0-SNAPSHOT.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/HdrHistogram-2.1.9.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/commons-collections-3.2.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/commons-lang-2.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/commons-pool-1.5.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/geronimo-jms_1.1_spec-1.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/geronimo-jta_1.1_spec-1.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/htrace-core4-4.2.0-incubating.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/mssql-jdbc-6.4.0.jre8.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/openjpa-jdbc-2.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/openjpa-kernel-2.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/openjpa-lib-2.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/serp-1.13.1.jar com.yahoo.ycsb.Client -t -db com.yahoo.ycsb.db.JdbcDBClient -s -P /home/atz2nd/Desktop/editycsb/YCSB/mssql/db.properties -P /home/atz2nd/Desktop/editycsb/YCSB/workloads/workloada -p recordcount=20 -threads 4 -p operationcount=10
Adding shard node URL: jdbc:sqlserver://localhost:1433;databaseName=ycsb
Adding shard node URL: jdbc:sqlserver://localhost:1433;databaseName=ycsb
Adding shard node URL: jdbc:sqlserver://localhost:1433;databaseName=ycsb
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
[OVERALL], RunTime(ms), 940
[OVERALL], Throughput(ops/sec), 10.638297872340425
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 2
[READ], AverageLatency(us), 84192.0
[READ], MinLatency(us), 78912
[READ], MaxLatency(us), 89471
[READ], 95thPercentileLatency(us), 89471
[READ], 99thPercentileLatency(us), 89471
[READ], Return=OK, 2
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 160.25
[CLEANUP], MinLatency(us), 42
[CLEANUP], MaxLatency(us), 362
[CLEANUP], 95thPercentileLatency(us), 362
[CLEANUP], 99thPercentileLatency(us), 362
[UPDATE], Operations, 8
[UPDATE], AverageLatency(us), 168940.0
[UPDATE], MinLatency(us), 88704
[UPDATE], MaxLatency(us), 227199
[UPDATE], 95thPercentileLatency(us), 227199
[UPDATE], 99thPercentileLatency(us), 227199
[UPDATE], Return=OK, 8